---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.ViewDesignOptionsConfig
source: html/ed4a77b5-623f-4113-dd47-cd162c6224e0.htm
---
# Autodesk.Revit.DB.ParameterTypeId.ViewDesignOptionsConfig Property

"Design Option Configuration"

## Syntax (C#)
```csharp
public static ForgeTypeId ViewDesignOptionsConfig { get; }
```